<!DOCTYPE html>
<html lang="fr">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
    <meta name="viewport" content="width=device-width">
    <title>v04 - z720.net
    </title>
    <link rel="alternate" href="http://z720.net/feed.xml" type="application/rss+xml" title="">
    <link rel="stylesheet" href="http://fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic|Anonymous+Pro:400,700,400italic,700italic|Merriweather:400,700,300">
  </head>
  <body>
    <header class="header">
      <div class="content-wrap">
        <h1>v04 (archives)</h1>
      </div>
    </header>
    <div id="content">
      <div class="content-wrap">
        <article class="article">
          <section class="content">Cela fait quelques temps que je n'ai pas post&eacute; mais c'est pour la bonne cause. Je suis en pleine refonte du site. La v04 se profile.<!--more--><p>Effectivement c'est un peu un effet d'annonce puisque pour le moment rien est pr&ecirc;t, m&ecirc;me pas une petite capture d'&eacute;cran &agrave;  vous pr&eacute;senter. Cependant le projet n'est pas anodin.</p>


<p>La premi&egrave;re raison c'est l'abandon du d&eacute;veloppement de zCMS comme syst&egrave;me de gestion de contenu perso car c'est beaucoup trop de charge de travail et je n'ai pas la dispo pour ce genre de chose en ce moment.</p>


<p>La seconde c'est la bascule. Dans l'abandon de zCMS pour g&eacute;rer la partie &quot;pages&quot; de ce site j'ai du m'orienter vers un syst&egrave;me de publication me permettant de g&eacute;rer facilement les pages et le blog. Je me suis orient&eacute; vers <a hreflang="en" href="http://wordpress.org">Wordpress</a>. Non pas parce que c'est mieux que <a hreflang="fr" href="http://www.dotclear.net">dotclear</a> mais simplement pour les fonctionnalit&eacute;s suppl&eacute;mentaires.</p>


<p>Je ne suis d'ailleurs pas persuad&eacute; que <a hreflang="fr" href="http://www.dotclear.net">le petit champion du weblog francophone</a> soit moins bon, au contraire. Je vais attendre patiemment que <a hreflang="fr" href="http://www.dotclear.net">dotclear</a> impl&eacute;mente les fonctions de gestion de pages, d'arborescence, de droit d'acc&egrave;s. Cela implique que le projet s'oriente dans cette voie et pour le moment cela ne semble pas &ecirc;tre le cas.</p>


<p>Peux-&ecirc;tre que je vais me lacher pour un plugin...</p>


<p>Autre fonctionnalit&eacute; de wordpress : poster par email. Cela va bien sur retarder le plugin pour dotclear que j'avais pr&eacute;vu de d&eacute;velopper, mais je n'abandonne pas...</p></section>
        </article>
      </div>
    </div>
    <footer>
      <section class="copy">
        <p>&copy; 1997-2013 z720 &mdash; powered by&nbsp;<a href="https://github.com/jnordberg/wintersmith">Wintersmith</a>
        </p>
      </section>
    </footer>
  </body>
</html>