<!DOCTYPE html>
<html lang="fr">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
    <meta name="viewport" content="width=device-width">
    <title>Fédération Hospitalière Privée (Rhône-Alpes Auvergne) - z720.net
    </title>
    <link rel="alternate" href="http://z720.net/feed.xml" type="application/rss+xml" title="">
    <link rel="stylesheet" href="http://fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic|Anonymous+Pro:400,700,400italic,700italic|Merriweather:400,700,300">
  </head>
  <body>
    <header class="header">
      <div class="content-wrap">
        <h1>Fédération Hospitalière Privée (Rhône-Alpes Auvergne) (archives)</h1>
      </div>
    </header>
    <div id="content">
      <div class="content-wrap">
        <article class="article">
          <section class="content"><p>Pr&eacute;sentation du projet de cr&eacute;ation du portail FHP-R2A.
Il s'agit du projet sur lequel je travaille actuellement&nbsp;: refonte du site <a href="http://www.fhpauvergne.com" hreflang="fr" title="Site de la FHP Auvergne">FHP Auvergne</a> et cr&eacute;ation d'un portail mutualis&eacute; avec la d&eacute;l&eacute;gation Rh&ocirc;ne Alpes.</p><!--more--> <h3>Qu'est ce que la <acronym title="F&eacute;d&eacute;ration de l&#039;Hospitalisation Priv&eacute;e">FHP</acronym>:</h3>


<p>Il s'agit de la f&eacute;d&eacute;ration de l'hospitalisation priv&eacute;e, syndicat professionnel des &eacute;tablissements de sant&eacute; priv&eacute;s</p>


<p>Extrait du site national de la <acronym title="F&eacute;d&eacute;ration de l&#039;Hospitalisation Priv&eacute;e">FHP</acronym>:
<q lang="fr" cite="http://195.3.8.57/fhp/htm/FHP_presentation1.asp">Regroupant quelques 1300 &eacute;tablissements, la FHP repr&eacute;sente l'int&eacute;gralit&eacute; des lits d'Hospitalisation en France. Organis&eacute;e en Syndicats R&eacute;gionaux et en Syndicats de Sp&eacute;cialit&eacute;s, la FHP est un interlocuteur privil&eacute;gi&eacute; des pouvoirs publics sur les grands th&egrave;mes qui engagent l'avenir du syst&egrave;me de sant&eacute;.</q></p>


<h3>Naissance du projet&nbsp;:</h3>


<p>L'id&eacute;e originale vient du d&eacute;l&eacute;gu&eacute; Auvergne de la FHP (responsable du site <a href="http://www.fhpauvergne.com" hreflang="fr" title="Site FHP Auvergne">www.fhpauvergne.com</a>) qui &eacute;tait d&eacute;sireux de refondre le site de sa région. La délégation de la région Rhône Alpes n'avait pas de site Internet et s'est naturellement associ&eacute;e afin de r&eacute;aliser un portail commun aux 2 r&eacute;gions limitrophes.</p>


<p>De cette id&eacute;e est n&eacute;e le projet de portail FHP-R2A pour FHP Rhône-Alpes Auvergne.</p>


<h3>Nature du projet&nbsp;:</h3>

<ul>
<li>Choix de syst&egrave;me de gestion de publication</li>
<li>R&eacute;alisation d'une nouvelle charte graphique</li>
<li>R&eacute;alisation des gabarits pour le <acronym title="Content Managment System">CMS</acronym></li>
</ul>

<p>Le choix du syst&egrave;me de publication s'est naturellement port&eacute; vers <a href="http://www.spip.net/fr" hreflang="fr" title="Site officiel de SPIP">SPIP 1.7.2</a> qui offrait presque toutes les fonctionnalités nécessaires au bon fonctionnement du portail&nbsp;:</p>
<ol>
<li>Publication d'articles avec validation</li>
<li>Interface d'administration conviviale</li>
<li>Gestion des documents attach&eacute;s aux articles</li>
<li>Gestion de forum</li>
<li>Identification des membres, auteurs et administrateurs</li>
<li>Architecture du site</li>
</ol>

<p>Seuls probl&egrave;mes&nbsp;:</p>
<ol>
<li>Pas de gestion en standard d'espace restreint dans la partie publique du site</li>
<li>Pas de gestion des droits d'acc&egrave;s aux fichiers des documents attach&eacute;s</li>
<li>Code g&eacute;n&eacute;r&eacute; par SPIP n'est pas parfaitement conforme aux standards du <a href="http://www.w3.org" hreflang="en" title="Site du W3C"><acronym title="World Wide Web Consortium">W3C</acronym></a></li>
</ol>

<p>Les 2 premiers points seront r&eacute;gl&eacute;s facilement par la multitude d'extensions disponibles pour SPIP et un peu de travail sur APACHE et <a href="http://www.php.net" hreflang="en" title="Site officiel PHP"><acronym title="PHP: Hypertext Preprocessor">PHP</acronym></a>.</p>


<p>Le dernier point n'est que partiellement r&eacute;solu en utilisant le moins possible les fonctions ne g&eacute;n&eacute;rant pas de <acronym title="(eXtensible) HyperText Markup Language">(X)HTML</acronym> valide dans les gabarits.</p>


<h3>R&eacute;alisation</h3>

<ul>
<li>Maquette de la charte graphique</li>
<li>Mise en place de la navigation</li>
<li>Param&eacute;trage SPIP</li>
<li>R&eacute;alisation des gabarits (squelettes SPIP)</li>
</ul>

<h3>Avancement</h3>


<p>Pour le moment le syst&egrave;me est quasiment op&eacute;rationnel, il manque encore quelques pages d'agr&eacute;ments (contact, cr&eacute;dits,...) Mais dans l'ensemble tout semble fonctionner comme pr&eacute;vu.</p>


<p>La release est bien sur pr&eacute;vue pour le mois de septembre. &Agrave; suivre&nbsp;: l'adresse du site d&egrave;s que les informations publi&eacute;es ne seront des donn&eacute;es de test...</p></section>
        </article>
      </div>
    </div>
    <footer>
      <section class="copy">
        <p>&copy; 1997-2013 z720 &mdash; powered by&nbsp;<a href="https://github.com/jnordberg/wintersmith">Wintersmith</a>
        </p>
      </section>
    </footer>
  </body>
</html>