{"title":["Déclencheurs JavaScript"],"link":["http://z720.net/blog/archives/2005/04/29/declencheurs-javascript"],"pubDate":["Fri, 29 Apr 2005 06:34:21 +0000"],"dc:creator":["seb"],"guid":[{"_":"http://v05.z720.net/blog/archives/2005/04/29/declencheurs-javascript","$":{"isPermaLink":"false"}}],"description":[""],"content:encoded":["<p> En dépit de la stricte séparation, les couches de présentation et de comportement ont besoin d'instructions de la couche structurelle. Elles ont besoin de savoir où ajouter cette jolie touche de style, quand initier ces petites actions qui font la différence. Elles ont besoin de déclencheurs. </p>\r\n<p>Traduction de l'article <a href=\"http://alistapart.com/articles/javascripttriggers/\" hreflang=\"en\">JavaScript Triggers</a>. <br />Translated with the permission of A List Apart Magazine (<a href=\"http://www.alistapart.com\" hreflang=\"en\">http://alistapart.com</a>) and the author[s].</p><!--more--><p> L'affichage d'une page web consiste en 3 couches. Le fichier XHTML représentent la couche structurelle qui contient la structure, la sémantique et le contenu du site. &Agrave; cette couche, il est possible de joindre une couche de mise en page (CSS) et une couche comportementale (JavaScript) afin de rendre le site plus beau et plus facile à utiliser. Ces trois couches doivent rester strictement séparées. On peut de cette façon changer toute la mise en page sans toucher ni à la structure ni aux comportements. </p>\r\n\r\n<p>En dépit de la stricte séparation, les couches de présentation et de comportement ont besoin d'instructions de la couche structurelle. Elles  en ont besoin pour savoir où ajouter cette jolie touche de style, quand initier cette petite action qui fait la différence. Elles ont besoin de déclencheurs</p>\r\n\r\n<p>Les déclencheurs CSS sont bien connus. Les attributs <code>class</code> et <code>id</code> vous permettent de contrôler totalement la présentation de vos sites web. Bien qu'il soit possible de travailler sans ces déclencheurs, en plaçant les instructions en ligne dans l'attribut <code>style</code>, cette méthode de codage est à proscrire. Si vous voulez redéfinir la présentation de votre site avec cette méthode, vous allez devoir modifier la couche structurelle en même temps, il s'agit d'une entorse à la régle de séparation de la présentation et de la structure.</p>\r\n\r\n<h2>Déclencheurs JavaScript</h2>\r\n\r\n<p>La couche comportementale doit fonctionner de la même manière. Il faut <a href=\"http://www.digital-web.com/articles/separating_behavior_and_structure_2/\" hreflang=\"en\"> séparer le comportement de la structure</a> en vous séparant des gestionnaires d'évenements en ligne comme celui-ci : <code>onmouseover=\"switchImages('fearful',6,false)\"</code>. &Agrave; la place, comme en CSS, nous allons utiliser des déclencheurs pour informer le script permettant la mise en oeuvre du comportement adéquate.</p>\r\n\r\n<p>Le déclencheur JavaScript le plus simple est l'attribut <code>id</code> :</p>\r\n\r\n<pre class=\"html\"><code>&lt;div id=\"navigation\"&gt;\r\n &lt;ul&gt;\r\n  &lt;li&gt;&lt;a href=\"#\"&gt;Link 1&lt;/a&gt;&lt;/li&gt;\r\n  &lt;li&gt;&lt;a href=\"#\"&gt;Link 2&lt;/a&gt;&lt;/li&gt;\r\n  &lt;li&gt;&lt;a href=\"#\"&gt;Link 3&lt;/a&gt;&lt;/li&gt;\r\n &lt;/ul&gt;\r\n&lt;/div&gt;\r\n</code></pre>\r\n<pre class=\"javascript\"><code>var x = document.getElementById('navigation');\r\nif (!x) return;\r\nvar y = x.getElementsByTagName('a');\r\nfor (var i=0;i&lt;y.length;i++)\r\n y[i].onmouseover = addBehavior;\r\n</code></pre>\r\n\r\n<p>Avec ce code, le comportement est déclenché par la présence ou l'absence de <code>id=\"navigation\"</code>. S'il est absent, il ne se passe rien (<code>if (!x) return</code>), mais s'il est présent tous les éléments liens qui en descendent auront un comportement au survol. Cette solution est simple et élégante, et elle fonctionne dans tous les navigateurs. Si l'<code>id</code> permet de couvrir vos besoins, vous n'avez pas besoin de lire la suite de cet article.</p>\r\n\r\n<h2>Déclencheurs avancés</h2>\r\n\r\n<p>Malheureusement, dans certaines situations il est impossible d'utiliser l'attribut <code>id</code> comme déclencheur:</p>\r\n\r\n<ol>\r\n<li>Un <code>id</code> doit être unique dans tout le document et vous pouvez avoir besoin d'un même comportement pour plusieurs (un groupe) éléments.</li>\r\n<li>Parfois un script a besoin de plus d'information que simplement &#8220;exécutez-moi ici.&#8221;</li>\r\n</ol>\r\n\r\n<p>Prenons pour ces 2 problèmes l'exemple d'un script de gestion de formulaire. Il serait pratique d'ajouter un déclencheur permettant d'indiquer qu'un champ est obligatoire. Si nous avions un tel déclencheur, nous pourrions utiliser un script aussi simple que le suivant.</p>\r\n\r\n<pre class=\"javascript\"><code>function validateForm()\r\n{\r\n var x = document.forms[0].elements;\r\n for (var i=0;i&lt;x.length;i++)\r\n {\r\n  if (<strong>[ce champ est obligatoire]</strong> && !x[i].value)\r\n    // Informer l'utilisateur de l'anomalie\r\n }\r\n}\r\n</code></pre>\r\n\r\n<p>Mais comment créer un déclencheur XHTML permettant d'indiquer au script que certains champs sont obligatoires&nbsp;? Utilisez un <code>id</code> n'est pas envisageable : car nous avons besoin d'une solution qui puisse fonctionner sur plusieurs champs. Il serait possible d'utiliser l'attribut <code>class</code> pour piloter ce comportement :</p>\r\n\r\n<pre class=\"html\"><code>&lt;input name=\"name\" class=\"required\" /&gt;\r\n</code></pre>\r\n<pre class=\"javascript\"><code>\r\nif (<strong>x[i].className == 'required'</strong> && !x[i].value)\r\n  // Informer l'utilisateur de l'anomalie\r\n</code></pre>\r\n\r\n<p>Pourtant, <a href=\"http://www.w3.org/TR/xhtml1/#C_13\" hreflang=\"en\">l'attribut <code>class</code> est plutôt dédié à la définition de styles CSS</a>. Mélanger des déclencheurs CSS et JavaScript n'est pas impossible mais peut mener rapidement à un amas de code confus: </p>\r\n\r\n<pre class=\"html\"><code>&lt;input name=\"name\" class=\"largefield required\" /&gt;\r\n</code></pre>\r\n<pre class=\"javascript\"><code>\r\nif (\r\n  <strong>x[i].className.indexOf('required') != -1</strong> &&\r\n  !x[i].value\r\n)\r\n</code></pre>\r\n\r\n<p>&Agrave; mon avis, l'attribut <code>class</code> ne devrait être utilisé <em>que</em> pour le CSS. Les classes sont les premiers déclencheurs XHTML pour la couche de présentation et les utiliser aussi pour porter une information de comportement complique les choses. Déclencher la couche de présentation et de comportement avec le même attribut <code>class</code> représente aussi une entorse à la stricte <a href=\"http://www.digital-web.com/articles/separating_behavior_and_presentation/\">séparation du comportement et de la présentation </a>, bien qu'en fin de compte  c'est à vous de choisir ce qui est acceptable à ce sujet.</p>\r\n\r\n<h2>Déclencheurs porteurs d'information</h2>\r\n\r\n<p>De plus ces déclencheurs peuvent prendre plus d'importance et être plus compliqués que la simple commande &#8220;déployez ce comportement ici&#8221;. Vous aurez certainement besoin de joindre une valeur à un déclencheur. Une valeur de déclenchement rendrait la couche comportementale beaucoup plus souple, puisqu'elle pourrait répondre à différentes conditions d'exécution pour chaque élément XHTML au lieu d'exécuter bêtement le même script.</p>\r\n\r\n<p>Prenez un formulaire dans lequel des zones de texte ont des tailles maximum pour paramètre. Le vieil attribut <code>MAXLENGTH</code> ne fonctionne pas avec les zones de texte, nous devons donc ecrire un petit script pour cela.  De plus toutes les zones de textes n'ont pas la même  longueur maximum, nous allons donc avoir à renseigner cette information quelque part de façon individuelle pour chaque zone de texte.</p>\r\n\r\n<p>Nous voulons avoir quelquechose de la forme :</p>\r\n\r\n<pre class=\"javascript\"><code>var x = document.getElementsByTagName('textarea');\r\nfor (var i=0;i&lt;x.length;i++)\r\n{\r\n if (<strong>[cette zone de texte a une longueur max]</strong>)\r\n  x[i].onkeypress = checkLength;\r\n}\r\n\r\nfunction checkLength()\r\n{\r\n var max = <strong>[Lecture de la longueur max]</strong>;\r\n if (this.value.length > max)\r\n  // Informer l'utilisateur de l'anomalie\r\n}\r\n</code></pre>\r\n\r\n<p>Ce script a besoin de 2 paramètres :</p>\r\n\r\n<ol>\r\n<li>Est-ce que cette zone de texte a une longueur maximum? Il s'agit ici du déclencheur qui informe le script qu'il y a un comportement à gérer. </li>\r\n<li>Quelle est la longueur max? C'est la valeur que le script doit vérifier pour valider la saisie utilisateur.</li>\r\n</ol>\r\n\r\n<p>Et c'est typiquement dans ce cas que la solution basée sur les classes montre ses limites. C'est toujours techniquement possible, mais le code à implémenter devient trop compliqué. Prenez une zone de texte avec la classe CSS \"large\" qui soit aussi obligatoire et dont la longueur max. est de 300 caractères: </p>\r\n\r\n<pre class=\"html\"><code>&lt;textarea class=\"large required maxlength=300\"&gt;\r\n&lt;/textarea&gt;\r\n</code></pre>\r\n\r\n<p>Non seulement cet exemple mélange de la présentation et 2 types de comportement, mais cela rend la longueur maximum de la zone de texte plus difficile à lire:</p>\r\n<pre class=\"javascript\"><code>var max = <strong>this.className.substring(this.className.indexOf('maxlength')+10)</strong>;\r\nif (this.value.length > max)\r\n // Informer l'utilisateur de l'anomalie\r\n</code></pre>\r\n\r\n<p>&Agrave; noter que ce bout de code ne fonctionne que si le paramètre longueur max. est placé en fin de valeur de classe. Si on veut placer la longueur max. n'importe où dans la valeur de classe (au cas où on voudrait ajouter un autre déclencheur après celui-ci) le code devient bien plus compliqué.</p>\r\n\r\n<h2>Le problème</h2>\r\n\r\n<p>C'est bien notre problème du jour. Comment ajouter de bon déclencheurs JavaScript qui nous permettent à la fois de couvrir le cas d'un simple déclenchement d'action (&#8220;exécutez-moi ici&#8221;) et celui du passage de valeur spécifique à l'éléments ?</p>\r\n\r\n<p>Techniquement, nous avons vu qu'il était possible de gérer ces cas avec l'attribut <code>class</code>, mais avons-nous le droit de détourner la fonction l'usage de cet attribut pour porter des informations pour lequel il n'est pas fait ? Est ce une entorse à la règle de séparation de la présentation et du comportement ? Et même si vous ne voyez pas d'obstacle à cette solution, elle reste tout de même  compliquée à mettre en oeuvre et requiert un code JavaScript assez ardu.</p>\r\n\r\n<p>Il est tout de fois possible d'utiliser d'ajouter des déclencheurs sur d'autres attributs comme <code>lang</code> ou <code>dir</code>, mais , encore une fois, ce serait une utilisation détournée d'attributs.</p>\r\n\r\n<h2>Attributs personnalisées</h2>\r\n\r\n<p>Je vos propose une autre solution. Reprenons l'exemple de la longueur max. de la zone de texte. Nous avons besoin de 2 informations:</p>\r\n\r\n<ol>\r\n<li>Est-ce que la zone de texte a une limite de taille ?</li>\r\n<li>Quelle est cette limite ?</li>\r\n</ol>\r\n\r\n<p>La manière naturelle et sémantique d'exprimer cette information serait d'ajouter un attribut à la zone de texte:</p>\r\n\r\n<pre class=\"html\"><code>&lt;textarea  class=\"large\" maxlength=\"300\" &gt;\r\n&lt;/textarea&gt;\r\n</code></pre>\r\n\r\n<p>La présence de l'attribut <code>maxlength</code> informe le script qu'il faut vérifier la saisie utilisateur dans cette zone de texte et il peut trouver la taille limite pour cette zone dans la valeur de l'attribut. De la même manière, pour le contrôle d'obligation de saisie, nous pouvons aussi créer un attribut personnalisé. <code>required=\"true\"</code>, par exemple, même si n'importe quelle valeur permet de déclencher le contrôle. </p>\r\n\r\n<pre class=\"html\"><code>&lt;textarea class=\"large\" maxlength=\"300\" required=\"true\"&gt;\r\n&lt;/textarea&gt;\r\n</code></pre>\r\n\r\n<p>Techniquement ce n'est pas un problème. La méthode DOM du W3C <code>getAttribute()</code> permet de lire n'importe quel attribut d'une balise. Seul Opera jusqu'à <a href=\"http://www.quirksmode.org/bugreports/archives/2005/01/existing_attrib.html\" title=\"Bug report\">sa version 7.54 ne permet pas  </a> de lire un attribut existant sur la mauvaise balise (comme <code>src</code> sur la balise <code>&lt;h2&gt;</code>). Heureusement les version ultérieur assure un support complet de la méthode <code>getAttribute()</code>.</p>\r\n\r\n<p>Voici donc ma solution&nbsp;:</p>\r\n\r\n<pre class=\"javascript\"><code>function validateForm()\r\n{\r\n var x = document.forms[0].elements;\r\n for (var i=0;i&lt;x.length;i++)\r\n {\r\n  if (<strong>x[i].getAttribute('required')</strong> && !x[i].value)\r\n    // Informer l'utilisateur que le champ est obligatoire\r\n }\r\n}\r\n\r\nvar x = document.getElementsByTagName('textarea');\r\n\r\nfor (var i=0;i&lt;x.length;i++)\r\n{\r\n if (<strong>x[i].getAttribute('maxlength')</strong>)\r\n  x[i].onkeypress = checkLength;\r\n}\r\n\r\nfunction checkLength()\r\n{\r\n var max = <strong>this.getAttribute('maxlength')</strong>;\r\n if (this.value.length &gt; max)\r\n  // Informer l'utilisateur que la longueur max est atteinte\r\n}\r\n</code></pre>\r\n\r\n<p>&Agrave; mon avis cette solution est simple à implémenter et cohérente avec la forme que les déclencheurs JavaScript peuvent prendre: une paire clé/valeur à l'endroit où la clé déclenche l'action et la valeur permet de conditionner l'action en fonction de chaque élément. Finalement, ajouter ces déclencheurs au code XHTML est très simple même  pour des webmaster débutants.</p>\r\n\r\n<h2>DTDs personnalisées</h2>\r\n\r\n<p>Après l'implémentation de cette solution vous pourrez noter que la page résultante n'est pas valide. &Agrave; la validation les attributs <code>required</code> et <code>maxlength</code>  sont rejetés car il ne sont pas autorisées dans le document. C'est bien sur complètement vrai : le premier attribut ne fait pas partie des spécifications XHTML, tandis  que le second n'est valide que sur un élément <code>&lt;input&gt;</code>.</p>\r\n\r\n<p>Pour résoudre ce problème, il suffit de les <em>rendre</em> valides; en créant une Définition de Type de Document (DTD) personnalisée qui étend XHTML pour inclure ces attributs déclencheurs. Cette DTD personnalisée définit nos attributs spéciaux et leur place dans le document, l'outil de validation permet de confronter la structure du document à notre version personnalisée de XHTML  Si la DTD déclare les attributs valides, c'est qu'ils le sont.</p>\r\n\r\n<p>Si vous ne savez pas créer de DTD personnalisée, vous pouvez lire l'article de J. David Eisenberg&#8217;s intitulé <a href=\"http://www.alistapart.com/articles/customdtd/\" hreflang=\"en\">Creating Custom DTDs</a> (NDT: ou la traduction français <a href=\"http://v05.z720.net/blog/archives/2005/03/03/valider-une-dtd-personnalisee\" hreflang=\"fr\">Valider une DTD personnalisée</a>) pour tout savoir sur le sujet.</p>\r\n\r\n<p>&Agrave; mon avis, utiliser des attributs personnalisés pour contrôler la couche comportementale et écrire des DTD personnalisées pour définir ces attributs correctement contribue à séparer comportement et structure et à écrire des scripts simples et efficaces. De plus une fois ces attributs déclarés et les scripts rédigés, même un webmaster débutant est capable d'ajouter facilement des comportements complexes dans les documents XHTML.</p>\r\n\r\n<h3 class=\"byline\">Version originale par <a href=\"http://alistapart.com/authors/peterpaulkoch/\" title=\"Voir tous les articles de Peter-Paul Koch sur A List Apart\" hreflang=\"en\">Peter-Paul Koch</a></h3>\r\n<p id=\"authorbio\">Peter-Paul Koch est développeur web indépendant  à Amsterdam en Hollande. Il écrit et maintient <a href=\"http://www.quirksmode.org/\">www.quirksmode.org</a>, un condensé d'environ 180 articles, trucs et astuces CSS et JavaScript, ainsi qu'un système de rapport de bogue et un blog</p>\r\n\r\n"],"excerpt:encoded":[""],"wp:post_id":["69"],"wp:post_date":["2005-04-29 08:34:21"],"wp:post_date_gmt":["2005-04-29 06:34:21"],"wp:comment_status":["closed"],"wp:ping_status":["closed"],"wp:post_name":["declencheurs-javascript"],"wp:status":["publish"],"wp:post_parent":["0"],"wp:menu_order":["0"],"wp:post_type":["post"],"wp:post_password":[""],"wp:is_sticky":["0"],"category":[{"_":"Développement","$":{"domain":"category","nicename":"developpement"}},{"_":"Traductions","$":{"domain":"category","nicename":"traductions"}},{"_":"Web","$":{"domain":"category","nicename":"web"}},{"_":"WebStandards","$":{"domain":"category","nicename":"webstandards"}}]}