{"title":["Wikini comme simple CMS"],"link":["http://z720.net/blog/archives/2005/07/11/wikini-simple-cms"],"pubDate":["Mon, 11 Jul 2005 11:28:59 +0000"],"dc:creator":["seb"],"guid":[{"_":"http://v05.z720.net/blog/archives/2005/05/07/wikini-cms","$":{"isPermaLink":"false"}}],"description":[""],"content:encoded":["<p>L'idée peut paraître originale, pourtant cela n'est pas idiot. Les fonctionnalités de base d'un moteur de wiki sont : la facilité d'édition et la possibilité pour n'importe qui d'intervenir sur le contenu... Pour avoir un CMS simple, il suffit de brider la seconde possibilité.</p>\r\n<!--more-->\r\n<p>Wikini est un outil intéressant car il s'agit d'un moteur de Wiki. </p>\r\n\r\n<h2>Les Wikis</h2>\r\n\r\n<p>Les wiki sont des outils de collaboration exceptionnels car ils permettent à tous les utilisateurs de modifier toutes les pages à volonté. Cette liberté peut faire peur dans un premier temps : est-ce que quelqu'un ne va pas supprimer ce que j'ai mis tant de temps à rédiger ? Il y a peu de risque car l'objectif  principal est la mise en commun d'informations.</p>\r\n\r\n<p>Cependant ce concept théorique se heurte souvent à la stupidité de certaines personnes... Cette liberté de création, modification ou suppression est souvent entourées dans ces outils de règles de propriété, d'appartenance à la communauté (attribution d'accès aux membres de confiance), et de gestion de version permettant de faire un retour arrière en cas de mauvaise manipulation ou d'abus de modification.</p>\r\n\r\n<h2>Pourquoi pas ?</h2>\r\n<p>Ce qui m'intéresse surtout dans ces outils, c'est la manière dont il est facile de rédiger une page&nbsp; : un clic pour modifier, le texte apparaît avec quelques raccourcis de mise en forme, on change le texte, on valide et la page est mise à jour.</p>\r\n\r\n<h2>Etude de cas : Site Vitrine</h2>\r\n<p>Dans le cas d'un site institutionnel vitrine, il faut mettre en place un site ne contenant que quelques pages, faciles à mettre à jour pour un néophyte en HTML.</p>\r\n\r\n<p>Dans un premier temps, je me suis dit que quelques pages statiques étaient suffisantes mais elles n'auraient pas été simples à maintenir par le client qui n'a que peu de connaissances en HTML.</p>\r\n\r\n<p>Dans un second temps, je me suis dit que le déploiement d'un outil de gestion de contenu type portail comme SPIP était trop lourd et qu'il n'y avait pas de réel besoin de rubriques, de news, de forum...</p>\r\n\r\n<p>Puis, je me suis dit que wikini pourrait être intéressant : facile à mettre, facile à mettre à jour, gestion des droits parfaite pour notre usage. Il suffisait de donner un réel look aux pages et de restreindre les fonctionnalités de collaboration afin maîtriser le contenu des pages du site.</p>\r\n\r\n<h2>Mode d'emploi</h2>\r\n<p>Il suffit de déterminer à l'avance le nom d'utilisateur de l'administrateur, de ne donner par défaut les droits de modification des pages à cet utilisateur. Ainsi quand une nouvelle page est créée, seul l'administrateur peut en changer le contenu.</p>\r\n\r\n<p>De plus avec la gestion des droits de wikini, il sera possible plus tard de créer des pages protégées où d'autres utilisateurs pourront faire des modifications : on aura sans peine un espace client interactif et restreint.</p>\r\n\r\n<p>Ensuite il faut changer l'entête standard de Wikini qui offre les services de base des wiki : retour à la PagePrincipale; liste des derniers changements, liste des  derniers commentaires, les paramètres de l'utilisateur courant. Ces fonctionnalités ne sont pas pertinentes dans notre cas, il nous faudrait plutôt une navigation à travers les pages importantes. Pour des raisons de flexibilité, il faudrait que la navigation puisse être gérée par le client, on pourra donc créer une page NaVigation qui sera facilement modifiable et dans laquelle il pourra mettre des raccourcis vers les pages importantes.</p>\r\n\r\n<p>Il ne reste plus qu'à modifier les droits d'accès pour les pages de gestion : statistiques, lien vers l'édition de la navigation, etc, pour ne laisser en accès public que les pages prévues. Selon les besoins, il est aussi possible de brider la fonction d'inscription de nouveaux membres pour maîtriser les utilisateurs avec pouvoir : création et modification de certaines pages.</p>\r\n\r\n<p>Il ne reste plus qu'à habiller le site avec un design adéquat en créant une feuille de style CSS. Ensuite le site peut être livré avec une petite formation&nbsp;: notion d'administration, édition des pages...</p>\r\n\r\n<p>Exemple en phase d'élaboration&nbsp;: <a href=\"http://astec.z720.net\">Astec (en développement)</a></p>\r\n\r\n<p><a href=\"http://technorati.com/tags\">Technorati Tags</a> : <a href=\"http://technorati.com/tag/wikini\" rel=\"tag\">wikini</a>, <a href=\"http://technorati.com/tag/CMS\">CMS</a>, <a href=\"http://technorati.com/tag/development\" rel=\"tag\">development</a></p>\r\n"],"excerpt:encoded":[""],"wp:post_id":["86"],"wp:post_date":["2005-07-11 13:28:59"],"wp:post_date_gmt":["2005-07-11 11:28:59"],"wp:comment_status":["closed"],"wp:ping_status":["closed"],"wp:post_name":["wikini-simple-cms"],"wp:status":["publish"],"wp:post_parent":["0"],"wp:menu_order":["0"],"wp:post_type":["post"],"wp:post_password":[""],"wp:is_sticky":["0"],"category":[{"_":"Design","$":{"domain":"category","nicename":"design"}},{"_":"Développement","$":{"domain":"category","nicename":"developpement"}},{"_":"Divers","$":{"domain":"category","nicename":"divers"}},{"_":"Projets","$":{"domain":"category","nicename":"projets"}},{"_":"Web","$":{"domain":"category","nicename":"web"}}]}