<!DOCTYPE html>
<html lang="fr">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
    <meta name="viewport" content="width=device-width">
    <title>Sauvegarder WordPress avec MySQL Administrator - z720.net
    </title>
    <link rel="alternate" href="http://z720.net/feed.xml" type="application/rss+xml" title="">
    <link rel="stylesheet" href="http://fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic|Anonymous+Pro:400,700,400italic,700italic|Merriweather:400,700,300">
  </head>
  <body>
    <header class="header">
      <div class="content-wrap">
        <h1>Sauvegarder WordPress avec MySQL Administrator (archives)</h1>
      </div>
    </header>
    <div id="content">
      <div class="content-wrap">
        <article class="article">
          <section class="content"><p>La sauvegarde de ses publications est une probl&eacute;matique
r&eacute;curente pour toutes les personnes qui publient sur
internet via une syst&egrave;me de gestion de contenu bas&eacute;
sur une base de donn&eacute;es. Effectivement lorsqu'on utilise un
site statique, il suffit de copier r&eacute;guli&egrave;rement le
contenu de son compte FTP sur son ordinateur personnel. Seulement
lorsque l'on utilise un CMS, les choses sont moins faciles : le
contenu proprement dit est souvent "cach&eacute;" dans une base de
donn&eacute;es et un bug dans le CMS peut &eacute;ventuellement
corrompre tout le site.</p>

<p>Je vous propose donc ici une m&eacute;thode assez facile pour
sauvegarder votre site. Cette m&eacute;thode est illustr&eacute;e
avec un site sous WordPress mais peut tout &agrave; fait convenir
pour tout autre CMS avec une base de donn&eacute;es
g&eacute;r&eacute;e par MySQL : SPIP, DotClear, Typo3...</p>

<!--more-->

<h2>Cas d'&eacute;tude</h2>

<p>Notre site est un weblog propuls&eacute; par WordPress tel que
distribu&eacute; par ses auteurs. Il a choisit ou
d&eacute;velopp&eacute; un th&egrave;me pour son site sur lequel il
ne fait plus de modifications. Bref son installation de WordPress
est stable, il ne modifie pas les sources et n'installe pas de
plugins souvent.</p>

<p>Notre utilisateur publie r&eacute;guli&egrave;rement du contenu et
craint de perdre ses publications en cas de probl&egrave;me chez
son h&eacute;bergeur ou en cas de mauvaise manipulation sur son
site. D'ailleurs il n'est pas expert en PHP ni en MySQL.</p>

<h2>Principe de base</h2>

<p>Etant donn&eacute; que le script de publication ne varie pas
beaucoup, la sauvegarde des fichiers PHP n'a pas besoin
d'&ecirc;tre tr&egrave;s fr&eacute;quente. En cas de perte de ses
fichiers sur le serveur, il lui suffira de r&eacute;installer
WordPress, son th&egrave;me et ses plugins. En revanche le contenu
de la base de donn&eacute;es doit &ecirc;tre sauvegarder
r&eacute;guli&egrave;rement. De plus si des plugins permettent la
sauvegarde de votre base sur votre serveur, il est plus sure de
garder une sauvegarde sur votre ordinateur personnel. Si votre
h&eacute;bergeur crash son syst&egrave;me, la sauvegarde sera bien
au chaud chez vous. C'est l&agrave; que MySQL Administrator va nous
&ecirc;tre tr&egrave;s utile.</p>

<h2>T&eacute;l&eacute;charger et installer MySQL Administrator</h2>

<p>Il suffit d'aller sur le site de MySQL dans <a href="http://dev.mysql.com/downloads/administrator/index.html" title="Page de t&eacute;l&eacute;chargement de MySQL Administrator">la
section d&eacute;di&eacute;e &agrave; Administrator</a> et de
choisir sa plateforme. MySQL Administrator est disponible pour
Windows, MacOS et Linux. Il est aussi possible de
t&eacute;l&eacute;charger les sources.</p>

<p>Puis il suffit de lancer l'installation.</p>

<p>Ensuite il faut configurer la connexion &agrave; la base de
donn&eacute;e. C'est l&agrave; que cela se complique : certains
h&eacute;bergeurs ne permettent pas d'&eacute;tablir de connexion
au serveur de base de donn&eacute;es depuis l'ext&eacute;rieur mais
uniquement depuis le serveur de votre h&eacute;bergement.
Contactez-le si vous avez un doute.</p>

<p><a href="http://v05.z720.net/blog/images/MySQL_Admin-connexion.gif"><img src="http://v05.z720.net/blog/images/MySQL_Admin-connexion.gif" alt="Capture d'écran : connexion"/></a></p>

<p>Vous devez renseigner au minimum le serveur, l'utilisateur MySQL
et son mot de passe.</p>

<p><a href="http://v05.z720.net/blog/images/MySQL_Admin-admin.gif"><img src="http://v05.z720.net/blog/images/MySQL_Admin-admin.gif" alt="Capture d'écran : Interface " /></a></p>

<p>Vous pouvez constater que MySQL Administrator permet de
contr&ocirc;ler totalement MySQL. Les 2 sections qui nous
int&eacute;ressent sont <strong>backup</strong> et
<strong>restore</strong>.</p>

<h2>Mettre en place des sauvegardes r&eacute;guli&egrave;res</h2>

<ol>
<li>Placez-vous dans la section backup</li>

<li>Cr&eacute;er une nouvelle sauvegarde avec le bouton New
Project.<br />
<a href="http://v05.z720.net/blog/images/MySQL_Admin-backup.gif"><img src="http://v05.z720.net/blog/images/MySQL_Admin-backup.gif" alt="Capture d'écran : Nouveau projet"/></a></li>

<li>Choisir un r&eacute;pertoire de destination</li>

<li>S&eacute;lectionner les param&egrave;tres du backup. L'option
"normal backup" est grandement suffisante.<br />
<a href="http://v05.z720.net/blog/images/MySQL_Admin-backup-advanced.gif"><img src="http://v05.z720.net/blog/images/MySQL_Admin-backup-advanced.gif" alt="Capture d'écran : Options avancées"/></a></li>

<li>S&eacute;lectionner le format de fichier</li>

<li>D&eacute;finir la fr&eacute;quence de sauvegarde&nbsp; 
<blockquote>
<p>Inutile de sauvegarder 5 fois votre base de
donn&eacute;es entre 2 mises &agrave; jour. Prenez en compte votre
fr&eacute;quence de publication, &eacute;ventuellement la
fr&eacute;quence de mise &agrave; jour des visiteurs via les
commentaires ou un forum.</p>
<p>Pensez &eacute;galement au volume de votre sauvegarde et &agrave;
votre bande passante : une base de donn&eacute;es de 2mo
sauvegard&eacute;e toutes les heures repr&eacute;sente 1.4Go de
bande passante par mois.</p>
</blockquote>
<br />
<a href="http://v05.z720.net/blog/images/MySQL_Admin-backup-schedule.gif"><img src="http://v05.z720.net/blog/images/MySQL_Admin-backup-schedule.gif" alt="Capture d'écran : planification" /></a></li>

<li>Renseigner l'utilisateur syst&egrave;me qui ex&eacute;cutera la
tache. <br />
<a href="http://v05.z720.net/blog/images/MySQL_Admin-backup-login.gif"><img src="http://v05.z720.net/blog/images/MySQL_Admin-backup-login.gif" alt="Capture d'écran : Identification système" /></a>
<br />Effectivement MySQL Administrator va g&eacute;n&eacute;rer
une tache planifi&eacute;e dans votre syst&egrave;me. Dans windows
vous pouvez acc&eacute;der aux taches planifi&eacute;es via le
panneau de configuration.<br />
<a href="http://v05.z720.net/blog/images/MySQL_Admin-backup-system.gif"><img src="http://v05.z720.net/blog/images/MySQL_Admin-backup-system.gif" alt="Capture d'écran : Planification système" /></a></li>
</ol>

<h2>Et les images?</h2>

<p>Si vous charger des fichiers tels que des images, de la musique
ou des documents, il faudra penser &agrave; utiliser la bonne
vieille m&eacute;thode pour sauvegarder ce contenu :
r&eacute;cup&eacute;rer par FTP le contenu du r&eacute;pertoire
o&ugrave; sont charg&eacute;s ces fichiers par WordPress. Il est
possible de trouver des logiciels qui fassent des
t&eacute;l&eacute;chargements p&eacute;riodiques de
r&eacute;pertoire FTP.
</p>

<h2>Prochaine étape</h2>
<p>Récupération de la base à partir de la sauvegarde... Bientôt</p></section>
        </article>
      </div>
    </div>
    <footer>
      <section class="copy">
        <p>&copy; 1997-2013 z720 &mdash; powered by&nbsp;<a href="https://github.com/jnordberg/wintersmith">Wintersmith</a>
        </p>
      </section>
    </footer>
  </body>
</html>